package com.learnwy.util.gen;//package com.learnwy.util.gen;
//
//
//import com.github.stuxuhai.jpinyin.PinyinException;
//import com.github.stuxuhai.jpinyin.PinyinFormat;
//import com.github.stuxuhai.jpinyin.PinyinHelper;
//
///**
// * Created by 25973 on 2017-05-14.
// */
//public class GenDishData {
//    public static void main(String[] args) {
//        /*精品海鲜*/
//        gen1("泡菜才鱼片", "48.00");
//        gen1("口味活财鱼", "48.00");
//        gen1("雪菜小黄鱼", "28.00");
//        gen1("香辣蟹", "88.00");
//        gen1("小鱼小虾", "28.00");
//        gen1("葱烧武昌鱼", "26.00");
//        gen1("姜辣甲鱼", "79.00");
//        gen1("水煮鱼片", "28.00");
//        gen1("水煮鳝片", "88.00");
//        gen1("干煸刁子鱼", "28.00");
//        gen1("家常烧鱼杂", "38.00");
//        gen1("鲫鱼炖水饺", "32.00");
//        gen1("特色烧椒鱼头", "58.00");
//        gen1("豆角烧茄子", "18.00");
//        gen1("香煎大白刁", "38.00");
//        gen1("养生泥鳅王", "58.00");
//        gen1("丰都辣子鱼", "58.00");
//        gen1("大碗胖头鱼", "48.00");
//        gen1("特色烤鱼", "48.00");
//        gen1("香辣基围虾", "48.00");
//        gen1("口味梭边鱼", "48.00");
//        gen1("口味臭桂鱼", "98.00");
///*家常口味*/
//        gen1("尖椒莴苣尖", "18.00");
//        gen1("家常豆腐", "18.00");
//        gen1("爆腰花", "48.00");
//        gen1("清炒菠菜", "15.00");
//        gen1("酸辣土豆丝", "15.00");
//        gen1("麻辣豆腐", "15.00");
//        gen1("番茄炒鸡蛋", "16.00");
//        gen1("干烧霉千张", "24.00");
//        gen1("虎皮青椒", "18.00");
//        gen1("芹菜干子肉丝", "18.00");
//        gen1("泡藕带炒牛肚", "32.00");
//        gen1("才鱼锅仔", "48.00");
//        gen1("铁板牛肉", "28.00");
//        gen1("铁板粉丝", "16.00");
//        gen1("花肉鸭血", "24.00");
//        gen1("农家牛排", "88.00");
//        gen1("干煸土豆丝", "20.00");
//        gen1("剁椒臭干子", "18.00");
//        gen1("小炒猪肝", "24.00");
//        gen1("爆炒猪肚", "38.00");
//        gen1("卤藕回锅牛肉", "38.00");
//        gen1("一品柴火豆腐", "28.00");
//        gen1("农家红烧肉", "38.00");
//        gen1("松仁玉米", "18.00");
//        gen1("泡菜苕粉肉丝", "18.00");
//        gen1("毛血旺", "38.00");
//        gen1("碎椒炒蛋", "18.00");
//        gen1("糖醋里脊", "22.00");
//        gen1("鱼香肉丝", "18.00");
//        gen1("玉米烧排骨", "38.00");
//        gen1("土豆烧牛腩", "38.00");
//        gen1("香干回锅肉", "24.00");
//        gen1("香菇肉片", "18.00");
//        gen1("杭椒炒肥肠", "38.00");
//        gen1("青椒肉丝", "18.00");
//        gen1("家常烧鱼块", "28.00");
//        gen1("外婆菜炒鸡蛋", "18.00");
//        gen1("椒盐玉米粒", "18.00");
//        gen1("杭椒小炒肉", "24.00");
//        gen1("干煸藕丝", "20.00");
//        gen1("大碗酱猪手", "38.00");
//        gen1("大盆山药", "24.00");
//        gen1("脆笋肉丝", "24.00");
//        gen1("川味回锅肉", "28.00");
//        gen1("口味野木耳", "24.00");
//        gen1("清炒菜苔", "18.00");
//        gen1("千张小白菜", "15.00");
//        gen1("滑藕片", "22.00");
//        gen1("藕带鸡杂", "38.00");
//        gen1("香辣牛蛙", "38.00");
//        gen1("姜辣凤爪", "58.00");
//        gen1("家常烧麻鸭", "88.00");
//        gen1("烧鸡公", "78.00");
///*田园时蔬*/
//        gen1("清炒苦瓜", "20.00");
//        gen1("山药炒藕片", "24.00");
//        gen1("小炒芦笋", "38.00");
//        gen1("大盆黄瓜", "18.00");
//        gen1("上汤娃娃菜", "24.00");
///*巴适火锅*/
//        gen1("辣排骨炖藕火锅", "78.00");
//        gen1("胖头鱼丸火锅", "68.00");
///*迷香干锅*/
//        gen1("干锅土豆片", "24.00");
//        gen1("干锅有机花菜", "26.00");
//        gen1("干锅四季豆", "26.00");
//        gen1("干锅手撕面筋", "22.00");
//        gen1("干锅杏鲍菇", "24.00");
//        gen1("干锅乳鸽皇", "78.00");
//        gen1("干锅鱿鱼须", "32.00");
//        gen1("干锅千叶豆腐", "22.00");
//        gen1("干锅茶树菇", "38.00");
//        gen1("干锅黄鳝鱼", "48.00");
//        gen1("干锅手撕鸡", "38.00");
///*腊味十足*/
//        gen1("腊鸭闷藕锅仔", "48.00");
//        gen1("腊肉豆丝", "28.00");
//        gen1("腊蹄炖土豆", "78.00");
///*甜食靓汤*/
//        gen1("米酒汤圆羹", "15.00");
//        gen1("拔丝香蕉", "22.00");
//        gen1("凤凰玉米羹", "15.00");
//        gen1("三鲜汤", "18.00");
//        gen1("土鸡汤", "38.00");
//        gen1("紫菜番茄蛋汤", "12.00");
//        gen1("皮蛋香菜鱼片汤", "18.00");
//        gen1("贺胜桥土鸡汤", "38.00");
//        gen1("弯骨海带汤", "38.00");
//        gen1("铜锅一品烩鱼丸", "38.00");
//        gen1("番茄牛腩煲", "38.00");
//        gen1("香芋地瓜丸", "18.00");
///*爽口凉菜*/
//        gen1("酸辣蕨根粉", "18.00");
//        gen1("五香卤藕", "15.00");
//        gen1("凉拌牛肚丝", "32.00");
//        gen1("香菜拌牛肉", "38.00");
//        gen1("酸辣凉粉", "15.00");
//        gen1("皮蛋拌豆腐", "15.00");
//        gen1("刀拍黄瓜", "15.00");
//        gen1("凉拌黑木耳", "20.00");
//        gen1("凉拌毛豆", "20.00");
//        gen1("醋泡花生米", "15.00");
///*酒水*/
//        gen1("雪花原汁麦", "4.00");
///*打包盒*/
//        gen1("小盒", "1.00");
//        gen1("大盒", "3.00");
//    }
//
//    public static void gen1(String name, String decimalStr) {
//        System.out.println(genDishDate(name, decimalStr));
//    }
//
//    public static String genDishDate(String name, String decimalStr) {
//        StringBuffer sb = new StringBuffer();
//        sb.append("('").append(name).append("',").append(decimalStr).append(",'").append(getDishPath(name)).append("'" +
//                ")");
//        return sb.toString();
//    }
//
//    private static String getDishPath(String name) {
//        StringBuffer sb = new StringBuffer();
//        sb.append("/images/dish/");
//        try {
//            sb.append(PinyinHelper.convertToPinyinString(name, ",", PinyinFormat.WITHOUT_TONE).replaceAll(",", "")
//            ).append(".png");
//        } catch (PinyinException e) {
//            e.printStackTrace();
//        }
//        return sb.toString();
//    }
//}
